wosayttn/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
/**************************************************************************//**
 * @file     CommandHandler.c
 * @version  V3.00
 * @brief    Secure ISP - Process commands
 *
 * @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <arm_cmse.h>
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#include "CommandHandler.h"

#define LIB_VERSION     (0x23551171UL) // 2355 + 'M' + 'DD' + IDX ... 1st released
uint32_t CMDLIB_VERSION(void)
{
    return LIB_VERSION;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Miscellaneous Constant Definitions                                                                      */
/*---------------------------------------------------------------------------------------------------------*/
#define CURVE_P_SIZE        CURVE_P_256     /* ECC key length */
#define ECC_KEY_SIZE        256             /* 256-bits */
#define ALL_ONE_2KB_CHKS    0x3F55D17Ful    /* 2K all CRC32 checksum value */


//volatile ISP_INFO_T     g_ISPInfo = {0};

///* Declare Client's ECC Key pair */
//const char gacPrivKey[] = "d0ab2cb9eb88976e82f107598077ce50d8c7b67def7039ee5ba39ee0dd3be411";
//const char gacPubKey0[] = "d32438a1b4428541c564eeed79669b4bd3bf601c758469545e013c8fe8af7ef6";
//const char gacPubKey1[] = "476de8f3c6e6c48a8bacf1e1827cfb82501833c2bb816344f996533b1b031706";

void Hex2Reg(char input[], uint32_t volatile reg[]);
void Reg2Hex(int32_t count, uint32_t volatile reg[], char output[]);

static uint32_t GetMaxAPROMSize(void)
{
    return FMC_APROM_END;
}

static uint8_t B2C(uint8_t c)
{
    if (c < 10)
        return (c + '0');

    if (c < 16)
        return (c - 10 + 'a');

    return 0;
}

static uint32_t Swap32(uint32_t value)
{
    volatile uint32_t val;

    /* __REV(x), byte swap32 for keil project */

    val = (value << 24) | ((value << 8) & 0xff0000) | ((value >> 8) & 0xff00) | (value >> 24);
    return val;
}

void BytesSwap(char *buf, int32_t len)
{
    int32_t i;
    char    tmp;

    for (i = 0; i < (len / 2); i++)
    {
        tmp = buf[len - i - 1];
        buf[len - i - 1] = buf[i];
        buf[i] = tmp;
    }
}

/**
  * @brief      Open SHA encrypt function
  * @param[in]  start       SHA encrypt start address
  * @param[in]  end         SHA encrypt end address
  * @param[out] digest      The SHA encrypt output digest
  * @param[in]  mode        SHA operation mode, including:
  *                             - \ref SHA_ONESHOT
  *                             - \ref SHA_CONTI_START
  *                             - \ref SHA_CONTI_ING
  *                             - \ref SHA_CONTI_END
  * @retval     0           Success
  * @retval     -1          Failed
  */
int32_t CalculateSHA256(uint32_t start, uint32_t end, uint32_t digest[], E_SHA_OP_MODE mode, E_SHA_SRC src)
{
    volatile int32_t    i, bytes;
    uint32_t            *ptr, addr, data, Hash[8];

    bytes   = end - start;
    ptr     = (uint32_t *)start;
    addr    = (uint32_t)ptr;

    if ((mode == SHA_ONESHOT) || (mode == SHA_CONTI_START))
    {
        printf("\n[Start SHA256 from 0x%x to 0x%x. (size: %d) (mode: %d)] (%s)\n", start, end, bytes, mode, (src == SHA_SRC_SRAM) ? "SRAM" : "Flash");

        //CRYPTO->HMAC_CTL = (SHA_MODE_SHA256 << CRYPTO_HMAC_CTL_OPMODE_Pos) | CRYPTO_HMAC_CTL_INSWAP_Msk;
        // Sync output byte order with PC
        CRYPTO->HMAC_CTL = (SHA_MODE_SHA256 << CRYPTO_HMAC_CTL_OPMODE_Pos) | CRYPTO_HMAC_CTL_INSWAP_Msk | CRYPTO_HMAC_CTL_OUTSWAP_Msk;
        CRYPTO->HMAC_DMACNT = 64;
        CRYPTO->HMAC_CTL |= CRYPTO_HMAC_CTL_START_Msk;
    }
    else
    {
        printf("[Continue SHA256 from 0x%x to 0x%x. (size: %d) (mode: %d)]\n", start, end, bytes, mode);
    }

    /* Start to calculate ... */
    while (bytes > 0)
    {
        if (bytes < 64)
            CRYPTO->HMAC_DMACNT = bytes;

        if (CRYPTO->HMAC_STS & CRYPTO_HMAC_STS_DATINREQ_Msk)
        {
            if (src == SHA_SRC_SRAM)
            {
                data = *ptr++;
                bytes -= 4;
            }
            else if (src == SHA_SRC_FLASH)
            {
                /* NOT Support calculate XOM region */
                if (addr < 512)
                    data = FMC_Read((addr & 0x0FFFFFFF)); /* First 512Byte using FMC ISP command */
                else
                    data = inpw((addr & 0x0FFFFFFF));

                addr += 4;
                bytes -= 4;
            }

            if (bytes <= 0)
                bytes = 0;

            /* bytes means remain byte counts */
            if (bytes != 0)
            {
                CRYPTO->HMAC_DATIN = data;
            }
            else
            {
                if ((mode == SHA_ONESHOT) || (mode == SHA_CONTI_END)) /* The last SHA operation */
                {
                    /* It's last word ... *-* */
                    CRYPTO->HMAC_CTL |= CRYPTO_HMAC_CTL_START_Msk | CRYPTO_HMAC_CTL_DMALAST_Msk;
                    CRYPTO->HMAC_DATIN = data;

                    while (CRYPTO->HMAC_STS & CRYPTO_HMAC_STS_BUSY_Msk);

                    for (i = 0; i < 8; i++)
                        Hash[i] = *(uint32_t *)((uint32_t) & (CRYPTO->HMAC_DGST[0]) + (i * 4));

                    memcpy(digest, Hash, sizeof(Hash));
                    printf("\t[SHA256 done]\n");
                    break;
                }
                else
                {
                    CRYPTO->HMAC_DATIN = data;
                    /* Exit to wait next SHA operation */
                }
            }
        }
    }

    return 0;
    /*
        Verify:
            Input:
                    String char -> "32107654" on PC tool
                    HEX byte    -> "3332313037363534" on PC tool and {0x30313233,0x34353637} in device
            Result:
                6952CF8EACE972CD4F10567331B46D85104E9E57402364F205876D13F84F7E42
                ==> Arraty {0x6952CF8E, 0xACE972CD, 0x4F105673....}
    */
}

