wosayttn/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
    return 0;
}

int32_t CMD_ParseReqPacket(CMD_PACKET_T *pCMD, ISP_INFO_T *pISPInfo)
{
    volatile int32_t    i;

#if (0)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        printf("Get REQ data:\n");

        for (i = 0; i < 2; i++)
            printf("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                printf("\n");

            printf("   0x%08x", pu32[i]);
        }

        printf("\n");
    }
#endif

    /* verify CRC32 */
    if (PACKET_ExecCRC32((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 4, 1) != 0)
    {
        printf("\n\tPacket CRC32 mismatch!\n");
        return -1;
    }

    for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
    {
        if (pISPInfo->au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not decrypt the cmd data */
    if (i != 8)
        PACKET_AES256Decrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), pISPInfo->au32AESKey, pISPInfo->au32AESIV);

#if (1)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;

        if (i != 8)
        {
            printf("AES KEY:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
                printf("   0x%08x", pISPInfo->au32AESKey[i]);

            printf("\nAES IV:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
                printf("   0x%08x", pISPInfo->au32AESIV[i]);

            printf("\n");
        }

        printf("Get REQ data:\n");

        for (i = 0; i < 2; i++)
            printf("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                printf("\n");

            printf("   0x%08x", pu32[i]);
        }

        printf("\n");
    }
#endif

    /* verify CCITT */
    if (PACKET_ExecCCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 1) != 0)
    {
        printf("\n\tPacket CCITT mismatch !\n");
        return -1;
    }

    printf("Parse cmd Pass.\n\n");
    return 0;
}



void CommandHandlerInit(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable FMC ISP */
    FMC_ENABLE_ISP();
    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    FMC_DISABLE_CFG_UPDATE();

    /* Enable CRYPTO clock */
    CLK_EnableModuleClock(CRYPTO0_MODULE);

    ECC_ENABLE_INT(CRYPTO);

    NVIC_EnableIRQ(CRYPTO_IRQn);

    /* Initial Random Number Generator */
    RNG_Open();
}





static int32_t GenRandomIV(ISP_INFO_T *pISPInfo)
{
    uint32_t    au32Buf[8];

    if (RNG_Random(au32Buf, 8) == 0)
        return -1;

    memcpy(pISPInfo->au32AESIV, au32Buf, (128 / 8)); // size is 128-bit

    return 0;
}

/*
    Stage 1.
    Valid commands:
        "CMD_RESYNC"     "CMD_CONNECT"   "CMD_DISCONNECT"
*/
int32_t ParseCONNECT(ISP_INFO_T *pISPInfo)
{
    volatile int32_t    i, ret = 0, cmd_case;
    CMD_PACKET_T        cmd;

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            printf("*** [Pasre error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    printf("[CMD_DISCONNECT] (stage 1)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_CONNECT:
                    printf("[CMD_CONNECT] (stage 1)\n");

                    for (i = 0; i < 4; i++)
                        pISPInfo->au32AESIV[i] = Swap32(cmd.au32Data[i]);

                    for (i = 0; i < 4; i++)
                    {
                        if (pISPInfo->au32AESIV[i] != 0)
                            break;
                    }

                    if (i == 4)
                    {
                        /* NO AESIV. Client will generate a new random AES IV */
                        GenRandomIV(pISPInfo);
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = SYS->PDID;

                    for (i = 0; i < 4; i++)
                        cmd.au32Data[2 + i] = Swap32(pISPInfo->au32AESIV[i]);

                    cmd.au32Data[6] = pISPInfo->u32CmdMask;
                    cmd.au32Data[7] = 0x0;//FMC->KPKEYSTS; /* KPKEYSTS: bit-4:KEYFLAG(1:enable/0:disable), bit-3:FORBID */
                    cmd.au32Data[8] = 0x0;//(((FMC->KPKEYCNT&0xFFFF)<<16) | (FMC->KPCNT&0xFFFF));

                    printf("PDID:  0x%08x.\n", cmd.au32Data[1]);

                    for (i = 0; i < 4; i++)
                        printf("Target IV[%d]: 0x%08x.\n", i, pISPInfo->au32AESIV[i]);

                    cmd.u16Len      = (4 * 9);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 1;
                    break;

                default:
                    printf("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

