wosayttn/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
                    for (i = 0; i < 8; i++)
                        printf("Out rand_pub1[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                default:
                    printf("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

        if (ret == -1)
            pISPInfo->IsConnectOK = 0;
    } while (0);

    CMD_GenRspPacket(&cmd, pISPInfo);

    memcpy(pISPInfo->rspbuf, (uint8_t *)&cmd, sizeof(CMD_PACKET_T));

    if ((ret == CMD_ECDH_PUB1) || (ret == CMD_ECDH_GET_RAND_PUB1))
    {
        if (ret == CMD_ECDH_PUB1)
        {
            /* Update 1st ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, AESKey, sizeof(AESKey));

            for (i = 0; i < 8; i++)
                printf("Gen 1st ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);
        }
        else
        {
            /* Update 2nd ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, pISPInfo->tmp0, sizeof(AESKey));

            for (i = 0; i < 8; i++)
                printf("Gen 2nd ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);

            memset(pISPInfo->tmp0, 0x0, sizeof(AESKey));
        }
    }

    memset(AESKey, 0x0, sizeof(AESKey));

    printf("Repone.\n\n");
    return ret;
}

// [Begin] TESTCHIP_ONLY - This function should be removed in M55M1.
uint32_t FMC_GetChkSum(uint32_t u32StartAddr, uint32_t u32ByteSize)
{
    uint32_t u32CRC32Checksum = 0xFFFFFFFF;
    uint32_t u32Addr;

    /* Configure CRC controller for CRC-CRC32 mode */
    CRC_Open(CRC_32, (CRC_WDATA_RVS | CRC_CHECKSUM_RVS | CRC_CHECKSUM_COM), 0xFFFFFFFFul, CRC_CPU_WDATA_32);
    CRC_SET_DMA_SADDR(CRC, u32StartAddr);
    CRC_SET_DMACNT_WORD(CRC, u32ByteSize / 4);
    CRC_DMA_START(CRC);

    while ((CRC_GET_STATUS(CRC) & CRC_DMASTS_FINISH_Msk) == 0)
        ;

    CRC->DMASTS = CRC_DMASTS_FINISH_Msk;
    u32CRC32Checksum = CRC_GetChecksum();

    return u32CRC32Checksum;
}
// [End] TESTCHIP_ONLY

int32_t _PageErase(uint32_t addr, uint32_t count, uint32_t u32CmdMask)
{
    volatile int32_t    i, ret = -1;

    printf("[Page erase] addr: 0x%x, page counts: %d.\n", addr, count);

    addr &= ~NS_OFFSET;

    /* Check address and counts */
    if (((addr % FMC_FLASH_PAGE_SIZE) != 0) || (count == 0))
        return ERR_PAGE_ALIGN;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((addr < GetMaxAPROMSize()) && (addr >= FMC_APROM_BASE))
    {
        if (count > (GetMaxAPROMSize() / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((addr + (count * FMC_FLASH_PAGE_SIZE)) > GetMaxAPROMSize())
            return ERR_OVER_RANGE;

        FMC_ENABLE_AP_UPDATE();
    }
    else if ((addr < FMC_LDROM_END) && (addr >= FMC_LDROM_BASE))
    {
        if (count > (FMC_LDROM_SIZE / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((addr + (count * FMC_FLASH_PAGE_SIZE)) > FMC_LDROM_END)
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    for (i = 0; i < count; i++)
    {
        ret = ERR_ISP_ERASE;

        /* perform erase page */
        if (FMC_Erase(addr) < 0)
            break;

        /* run 2K checksum and verify its result */
        if (FMC_GetChkSum(addr, FMC_FLASH_PAGE_SIZE) != ALL_ONE_2KB_CHKS)
            break;

        addr += FMC_FLASH_PAGE_SIZE;
        ret = 0;
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    return ret;
}

static int32_t _IsValidFlashRegion(uint32_t addr, uint32_t size, uint32_t u32CmdMask)
{
    printf("[Check flash region] addr: 0x%x, size: %d.\n", addr, size);

    /* Not use u32CmdMask */

    addr &= ~NS_OFFSET;

    /* Check address and length */
    if ((addr % 4) != 0)
        return ERR_INVALID_ADDRESS;

    if (((size % 4) != 0) || (size == 0))
        return ERR_INVALID_ADDRESS;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((addr < GetMaxAPROMSize()) && (addr >= FMC_APROM_BASE))
    {
        if (((addr + size) > GetMaxAPROMSize()) || ((addr + size) < addr))
            return ERR_OVER_RANGE;

        FMC_ENABLE_AP_UPDATE();
    }
    else if ((addr < FMC_LDROM_END) && (addr >= FMC_LDROM_BASE))
    {
        if (((addr + size) > FMC_LDROM_END) || ((addr + size) < addr))
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    return 0;
}

static int32_t _ISPWrite(uint32_t addr, uint32_t data)
{
    FMC->ISPCMD = FMC_ISPCMD_PROGRAM;
    FMC->ISPADDR = addr;
    FMC->ISPDAT = data;
    FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

    while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) ;

    /* Clear ISPFF if cmd FAIL */
    if (FMC->ISPCTL & FMC_ISPCTL_ISPFF_Msk)
    {
        FMC->ISPCTL |= FMC_ISPCTL_ISPFF_Msk;
        return -1;
    }

    return 0;
}

static uint32_t _ISPRead(uint32_t addr)
{
    FMC->ISPCMD = FMC_ISPCMD_READ;
    FMC->ISPADDR = addr;
    FMC->ISPTRG = FMC_ISPTRG_ISPGO_Msk;

    while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk) { }

    /* Clear ISPFF if cmd FAIL */
    if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
    {
        FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
        return -1;
    }

